/*Создание zip архива, добавление туда файла, определение размера архива
Создать архив в форматер zip
Добавить файл в архив
Разархивировать файл и вывести данные о нем
Удалить файл и архив*/
using System;

namespace _5
{
  class Program
  {
    static void Main(string[] args)
    {
      Console.WriteLine("Hello World!");
    }
  }
}
